@echo off
cls
chcp 65001>nul

set kembali=%~dp0..\OS_Mini.bat
set spam=%~dp0..\Apps\Spam_WA\spam_wa.bat

for /F "tokens=1,2 delims=#" %%a in ('"prompt #$H#$E# & echo on & for %%b in (1) do rem"') do set ESC=%%b
title Hecking ^| By : BDA Project
mode con: cols=90 lines=18

:menu
cls
echo                                                              ^|
echo %ESC%[38;5;196m   ██╗  ██╗███████╗ ██████╗██╗  ██╗██╗███╗   ██╗ ██████╗%ESC%[0m     ^|    Welcome To Hecking
echo %ESC%[38;5;202m   ██║  ██║██╔════╝██╔════╝██║ ██╔╝██║████╗  ██║██╔════╝%ESC%[0m     ^|
echo %ESC%[38;5;208m   ███████║█████╗  ██║     █████╔╝ ██║██╔██╗ ██║██║  ███╗%ESC%[0m    ^| * Time : %time%
echo %ESC%[38;5;214m   ██╔══██║██╔══╝  ██║     ██╔═██╗ ██║██║╚██╗██║██║   ██║%ESC%[0m    ^| * Date : %date%
echo %ESC%[38;5;220m   ██║  ██║███████╗╚██████╗██║  ██╗██║██║ ╚████║╚██████╔╝%ESC%[0m    ^| * Author : BDA Project
echo %ESC%[38;5;226m   ╚═╝  ╚═╝╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝╚═╝  ╚═══╝ ╚═════╝%ESC%[0m     ^|
echo ==========================================================================================
echo.
echo   [1] Matrix
echo   [2] Spam
echo   [3] Kembali
echo   [E] Keluar
echo.
choice /c 123e /n /m "| [>] "
if %errorlevel%==1 call matrix.bat
if %errorlevel%==2 call "%spam%"
if %errorlevel%==3 call "%kembali%"
if %errorlevel%==4 call exit.bat