@echo off
cls
chcp 65001>nul
for /F "tokens=1,2 delims=#" %%a in ('"prompt #$H#$E# & echo on & for %%b in (1) do rem"') do set ESC=%%b
set masuk=%~dp0config\masuk.bat
set kembali=%~dp0..\..\OS_Mini.bat
title Calculator ^| By : Raia Shop
mode con: cols=118 lines=17

:menu
cls
echo                                                                                          ^|
echo %ESC%[38;5;196m   ██████╗ █████╗ ██╗      ██████╗██╗   ██╗██╗      █████╗ ████████╗ ██████╗ ██████╗%ESC%[0m     ^|  Welcome To Calculator
echo %ESC%[38;5;202m  ██╔════╝██╔══██╗██║     ██╔════╝██║   ██║██║     ██╔══██╗╚══██╔══╝██╔═══██╗██╔══██╗%ESC%[0m    ^|
echo %ESC%[38;5;208m  ██║     ███████║██║     ██║     ██║   ██║██║     ███████║   ██║   ██║   ██║██████╔╝%ESC%[0m    ^| * Date   : %date%
echo %ESC%[38;5;214m  ██║     ██╔══██║██║     ██║     ██║   ██║██║     ██╔══██║   ██║   ██║   ██║██╔══██╗%ESC%[0m    ^| * Time   : %time%
echo %ESC%[38;5;220m  ╚██████╗██║  ██║███████╗╚██████╗╚██████╔╝███████╗██║  ██║   ██║   ╚██████╔╝██║  ██║%ESC%[0m    ^| * Author : Raia Shop
echo %ESC%[38;5;226m   ╚═════╝╚═╝  ╚═╝╚══════╝ ╚═════╝ ╚═════╝ ╚══════╝╚═╝  ╚═╝   ╚═╝    ╚═════╝ ╚═╝  ╚═╝%ESC%[0m    ^|
echo ======================================================================================================================
echo.
echo   [1] Masuk
echo   [2] Kembali
echo   [E] Keluar
echo.
choice /c 12e /n /m "| [>] "
if %errorlevel%==1 call "%masuk%"
if %errorlevel%==2 call "%kembali%"
if %errorlevel%==4 exit