@echo off
chcp 65001>nul
set "spam=%~dp0config\spam.py"
set "kembali=%~dp0..\..\config\hecking.bat"
for /F "tokens=1,2 delims=#" %%a in ('"prompt #$H#$E# & echo on & for %%b in (1) do rem"') do set ESC=%%b
title Spam WA ^| By : BDA Project
mode con: cols=90 lines=17

:menu
echo                                                                 ^|
echo %ESC%[38;5;196m   ███████╗██████╗  █████╗ ███╗   ███╗    ██╗    ██╗ █████╗ %ESC%[0m    ^|  Welcome To Spam WA
echo %ESC%[38;5;202m   ██╔════╝██╔══██╗██╔══██╗████╗ ████║    ██║    ██║██╔══██╗%ESC%[0m    ^|
echo %ESC%[38;5;208m   ███████╗██████╔╝███████║██╔████╔██║    ██║ █╗ ██║███████║%ESC%[0m    ^| * Time   : %time%
echo %ESC%[38;5;214m   ╚════██║██╔═══╝ ██╔══██║██║╚██╔╝██║    ██║███╗██║██╔══██║%ESC%[0m    ^| * Date   : %date%
echo %ESC%[38;5;220m   ███████║██║     ██║  ██║██║ ╚═╝ ██║    ╚███╔███╔╝██║  ██║%ESC%[0m    ^| * Author : Raia Shop
echo %ESC%[38;5;226m   ╚══════╝╚═╝     ╚═╝  ╚═╝╚═╝     ╚═╝     ╚══╝╚══╝ ╚═╝  ╚═╝%ESC%[0m    ^|
echo ==========================================================================================
echo.
echo    [1] Masuk
echo    [2] Test spam
echo    [E] Kembali
echo.
choice /c 12e /n /m "|  [>] "
if %errorlevel%==1 python %spam%
if %errorlevel%==2 start notepad & python %spam%
if %errorlevel%==3 call %kembali%
